---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlywoodSharpness
source: html/0f8e45f0-2370-ab71-0ad7-9d821a4e030f.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlywoodSharpness Property

The property labeled "Percentage of pure earlywood" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodEarlywoodSharpness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".